dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxSmu_bf.h
/** \brief Offset for Ifx_SMU_AEX_Bits.IRQ0STS */
#define IFX_SMU_AEX_IRQ0STS_OFF (0u)

/** \brief Length for Ifx_SMU_AEX_Bits.IRQ1STS */
#define IFX_SMU_AEX_IRQ1STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.IRQ1STS */
#define IFX_SMU_AEX_IRQ1STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.IRQ1STS */
#define IFX_SMU_AEX_IRQ1STS_OFF (1u)

/** \brief Length for Ifx_SMU_AEX_Bits.IRQ2STS */
#define IFX_SMU_AEX_IRQ2STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.IRQ2STS */
#define IFX_SMU_AEX_IRQ2STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.IRQ2STS */
#define IFX_SMU_AEX_IRQ2STS_OFF (2u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST0STS */
#define IFX_SMU_AEX_RST0STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST0STS */
#define IFX_SMU_AEX_RST0STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST0STS */
#define IFX_SMU_AEX_RST0STS_OFF (3u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST1STS */
#define IFX_SMU_AEX_RST1STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST1STS */
#define IFX_SMU_AEX_RST1STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST1STS */
#define IFX_SMU_AEX_RST1STS_OFF (4u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST2STS */
#define IFX_SMU_AEX_RST2STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST2STS */
#define IFX_SMU_AEX_RST2STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST2STS */
#define IFX_SMU_AEX_RST2STS_OFF (5u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST3STS */
#define IFX_SMU_AEX_RST3STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST3STS */
#define IFX_SMU_AEX_RST3STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST3STS */
#define IFX_SMU_AEX_RST3STS_OFF (6u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST4STS */
#define IFX_SMU_AEX_RST4STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST4STS */
#define IFX_SMU_AEX_RST4STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST4STS */
#define IFX_SMU_AEX_RST4STS_OFF (7u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST5STS */
#define IFX_SMU_AEX_RST5STS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST5STS */
#define IFX_SMU_AEX_RST5STS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST5STS */
#define IFX_SMU_AEX_RST5STS_OFF (8u)

/** \brief Length for Ifx_SMU_AEX_Bits.NMISTS */
#define IFX_SMU_AEX_NMISTS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.NMISTS */
#define IFX_SMU_AEX_NMISTS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.NMISTS */
#define IFX_SMU_AEX_NMISTS_OFF (9u)

/** \brief Length for Ifx_SMU_AEX_Bits.EMSSTS */
#define IFX_SMU_AEX_EMSSTS_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.EMSSTS */
#define IFX_SMU_AEX_EMSSTS_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.EMSSTS */
#define IFX_SMU_AEX_EMSSTS_OFF (11u)

/** \brief Length for Ifx_SMU_AEX_Bits.IRQ0AEM */
#define IFX_SMU_AEX_IRQ0AEM_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.IRQ0AEM */
#define IFX_SMU_AEX_IRQ0AEM_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.IRQ0AEM */
#define IFX_SMU_AEX_IRQ0AEM_OFF (16u)

/** \brief Length for Ifx_SMU_AEX_Bits.IRQ1AEM */
#define IFX_SMU_AEX_IRQ1AEM_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.IRQ1AEM */
#define IFX_SMU_AEX_IRQ1AEM_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.IRQ1AEM */
#define IFX_SMU_AEX_IRQ1AEM_OFF (17u)

/** \brief Length for Ifx_SMU_AEX_Bits.IRQ2AEM */
#define IFX_SMU_AEX_IRQ2AEM_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.IRQ2AEM */
#define IFX_SMU_AEX_IRQ2AEM_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.IRQ2AEM */
#define IFX_SMU_AEX_IRQ2AEM_OFF (18u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST0AEM */
#define IFX_SMU_AEX_RST0AEM_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST0AEM */
#define IFX_SMU_AEX_RST0AEM_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST0AEM */
#define IFX_SMU_AEX_RST0AEM_OFF (19u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST1AEM */
#define IFX_SMU_AEX_RST1AEM_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST1AEM */
#define IFX_SMU_AEX_RST1AEM_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST1AEM */
#define IFX_SMU_AEX_RST1AEM_OFF (20u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST2AEM */
#define IFX_SMU_AEX_RST2AEM_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST2AEM */
#define IFX_SMU_AEX_RST2AEM_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST2AEM */
#define IFX_SMU_AEX_RST2AEM_OFF (21u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST3AEM */
#define IFX_SMU_AEX_RST3AEM_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST3AEM */
#define IFX_SMU_AEX_RST3AEM_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST3AEM */
#define IFX_SMU_AEX_RST3AEM_OFF (22u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST4AEM */
#define IFX_SMU_AEX_RST4AEM_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST4AEM */
#define IFX_SMU_AEX_RST4AEM_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST4AEM */
#define IFX_SMU_AEX_RST4AEM_OFF (23u)

/** \brief Length for Ifx_SMU_AEX_Bits.RST5AEM */
#define IFX_SMU_AEX_RST5AEM_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.RST5AEM */
#define IFX_SMU_AEX_RST5AEM_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.RST5AEM */
#define IFX_SMU_AEX_RST5AEM_OFF (24u)

/** \brief Length for Ifx_SMU_AEX_Bits.NMIAEM */
#define IFX_SMU_AEX_NMIAEM_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.NMIAEM */
#define IFX_SMU_AEX_NMIAEM_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.NMIAEM */
#define IFX_SMU_AEX_NMIAEM_OFF (25u)

/** \brief Length for Ifx_SMU_AEX_Bits.EMSAEM */
#define IFX_SMU_AEX_EMSAEM_LEN (1u)

/** \brief Mask for Ifx_SMU_AEX_Bits.EMSAEM */
#define IFX_SMU_AEX_EMSAEM_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEX_Bits.EMSAEM */
#define IFX_SMU_AEX_EMSAEM_OFF (27u)

/** \brief Length for Ifx_SMU_AEXCLR_Bits.IRQ0CLR */
#define IFX_SMU_AEXCLR_IRQ0CLR_LEN (1u)

/** \brief Mask for Ifx_SMU_AEXCLR_Bits.IRQ0CLR */
#define IFX_SMU_AEXCLR_IRQ0CLR_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEXCLR_Bits.IRQ0CLR */
#define IFX_SMU_AEXCLR_IRQ0CLR_OFF (0u)

/** \brief Length for Ifx_SMU_AEXCLR_Bits.IRQ1CLR */
#define IFX_SMU_AEXCLR_IRQ1CLR_LEN (1u)

/** \brief Mask for Ifx_SMU_AEXCLR_Bits.IRQ1CLR */
#define IFX_SMU_AEXCLR_IRQ1CLR_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEXCLR_Bits.IRQ1CLR */
#define IFX_SMU_AEXCLR_IRQ1CLR_OFF (1u)

